/*Single_row функции - это функции у которых на каждый input есть один output
  вообщем сколько входов, столько и выходов
*/

/* - Character функции - это функции которые работают с текстом или со String
   - Numeric функции - это функции которые работают с числами
   - Date функции - это функции которые работают с датами
   - Conversion функции - это функции которые конвертируют, преобразовывают
   типы данных, например значения наших столбцов
   - General функции - это функции(переводится как общий) эти функции работают 
   с null значениями и еще способствуют применению логических условий в наших 
   селектах
*/

