/*NAMESPACE
Есть определенные правила которым должны удовлетворять названия любого объекта:
- Имя должно быть больше одного и не больше 30 символов
- объект не может называтьмя рарезервированным словом например 'FROM'
- имя должно начинаться с a-z , 2new_emps нельзя
- имя может содержать '_' , '$' , '#' 
- прописные буквы будут всегда конвертированы в заглавные
но если название взять в двойные ковычки, то все правила кроме длины можно 
проигнорировать, но обращаться к ней можно также только через двойные ковычки
(но так делать не рекомендуется)
*/